//-------------------------------------------------------------------------------
// Définition des PINs
//-------------------------------------------------------------------------------
#define TWAI_TX_PIN     4
#define TWAI_RX_PIN     5
#define GPS_TX_PIN      44
#define GPS_RX_PIN      43
#define LED_PIN         38
#define BUTTON1_PIN     14 

//-------------------------------------------------------------------------------
// Définition des constantes
//-------------------------------------------------------------------------------
#define LED_COUNT 1
#define LED_BLINK_INTERVAL 500  // Nouvel intervalle de clignotement à 200ms

//-------------------------------------------------------------------------------
// Adresse Bus CAN
//-------------------------------------------------------------------------------
#define TWAI_MSG_ID 0x400 // ID 400 en hexadécimal
